
  #### Terraform Format 🖌: `success`
  #### Terraform Init ⚙️: `success`
  #### Terraform Validate 🤖: `success`
  #### Terraform Plan 📖: `success`

  <details><summary>Plan Details</summary>

  ```bash
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # portainer_stack.swarm_repo["hello-world"] will be created
  + resource "portainer_stack" "swarm_repo" {
      + compose_format                = false
      + deployment_type               = "swarm"
      + endpoint_id                   = 1
      + file_path_in_repository       = "hello-world/docker-compose.yml"
      + force_update                  = false
      + git_repository_authentication = false
      + id                            = (known after apply)
      + method                        = "repository"
      + name                          = "hello-world"
      + prune                         = false
      + pull_image                    = false
      + repository_reference_name     = "refs/heads/main"
      + repository_url                = "https://github.com/ggmanugg/homelab_terra"
      + stack_webhook                 = false
      + support_relative_path         = false
      + swarm_id                      = (known after apply)
      + tlsskip_verify                = false
      + webhook_id                    = (known after apply)
      + webhook_url                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>

  *Run by @ggmanugg via `pull_request`*
